[
    {
        "details": "The Mitsubishi 3000GT is a front-engine, all-wheel/front-wheel drive grand touring/sports car manufactured and marketed by Mitsubishi from 1990 until 2000 over three different generations. Manufactured in a three-door hatchback coupé body style in Nagoya, Japan, the 2+2 four-seaters were marketed in the Japanese domestic market (JDM) as the GTO, and globally as 3000GT. In North America, it was sold both as the Mitsubishi 3000GT (1991–1999) and the Dodge Stealth (1991–1996), a badge engineered, mechanically identical captive import. As a collaborative effort between Chrysler and Mitsubishi Motors, Chrysler was responsible for the Stealth's exterior styling.",
        "icon": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Mitsubishi_logo.svg",
        "name": "1990-1999 Mitsubishi 3000GT",
        "image": "https://upload.wikimedia.org/wikipedia/commons/8/83/Mitsubishi_3000GT_--_03-21-2012.JPG"
    },
    {
        "details": "In November 1993, the Mustang debuted its first major redesign in fifteen years. Code-named \"SN95\" by the automaker, it was based on an updated version of the rear-wheel drive Fox platform called \"Fox-4.\" The new styling by Patrick Schiavone incorporated several styling cues from earlier Mustangs.[53] For the first time since its introduction 1964, a notchback coupe model was not available. The door windows on the coupe were once again frameless; however, the car had a fixed \"B\" pillar and rear windows",
        "icon": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Ford_logo_flat.svg/2560px-Ford_logo_flat.svg.png",
        "name": "1993-2004 Ford Mustang",
        "image": "https://upload.wikimedia.org/wikipedia/commons/d/df/2002_Ford_Mustang_GT_Coupe_in_Mineral_Grey_Metallic%2C_Front_Right%2C_05-06-2023.jpg"
    },
    {
        "details": "Introduced on 7 November 1996, the fifth-generation Prelude retained an FF layout with an independent front suspension and 63/37 weight distribution. The fifth-generation Prelude marked a return to the more square bodystyle of the third generation (1987–1991), in an attempt to curb slumping sales of the fourth-generation bodystyle. A two-door notchback style is retained but the design is less aggressive and more angular than the previous generation. The redesigned sports coupe is slightly larger than its predecessor at 1.4 inches (36 mm) longer in wheelbase and 3.2 inches (81 mm) overall. Base curb weight increased by 145 pounds (66 kg) and interior dimensions are nearly identical but trunk space expanded by nearly 1 cubic foot.",
        "icon": "https://upload.wikimedia.org/wikipedia/commons/f/f8/Logo_Honda_F1.png",
        "name": "1996-2001 Honda Prelude",
        "image": "https://upload.wikimedia.org/wikipedia/commons/0/01/1998_Honda_Prelude_VTi_Automatic_2.2_Front.jpg"
    }
]